Tutorials/Simple_Geometry/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\ 
  =========                 | 
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox 
   \\    /   O peration     | Website:  https://openfoam.org 
    \\  /    A nd           | Version:  7 
     \\/     M anipulation  | 
\*---------------------------------------------------------------------------*/ 
FoamFile
{ 
    version     2.0; 
    format      ascii; 
    class       dictionary; 
    object      blockMeshDict; 
} 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

scale 0.001;

vertices
(
 	(0 0 -3.56) //0
 	(0 0 -2.81) //1
	(0 0 0) //2
	(0 0 7.14) //3
	(0 2 -3) //4
	(0 2 -1.56) //5
	(0 0.5 0) //6
	(0 1 7.14) //7
	(1 0 -3.56) //8
	(1 0 -2.81) //9	
	(1 0 0) //10
	(1 0 7.14) //11
	(1 2 -3) //12
	(1 2 -1.56) //13
	(1 0.5 0) //14
	(1 1 7.14) //15 
	(0 1.25 -1.56) //16
	(1 1.25 -1.56) //17
	(0 2 -1.56) //18
	(1 2 -1.56) //19
);

blocks
(
 	hex (0 1 9 8 18 16 17 19) (25 1 45) simpleGrading (1 1 0.1)
 	hex (1 2 10 9 16 6 14 17) (100 1 45) simpleGrading (1 1 0.1)
 	hex (2 3 11 10 6 7 15 14) (250 1 45) simpleGrading (1 1 0.1)
);

edges
(
 	arc 16 6 (0 1.25 1.56)
 	arc 17 14 (1 1.25 1.56)

	arc 0 18 (0 0 0.44)
	arc 8 19 (1 0 0.44)

	arc 16 1 (0 -1.25 -1.56)
	arc 17 9 (1 -1.25 -1.56)
);


boundary
(
 	inlet
 	{
 		type patch;
 		faces
 		(
 			(0 8 19 18)
 		);
 	}

	outlet
 	{
 		type patch;
 		faces
 		(
 			(11 3 7 15)
 		);
 	}

 	axis
 	{
 		type empty;
 		faces
 		(
 			(8 0 1 9)
 			(9 1 2 10)
 			(10 2 3 11)
 		);
 	}

 	top
 	{
 		type wall;
 		faces
 		(
 			(16 17 14 6)
 			(6 14 15 7)
			(18 19 17 16)
 		);
 	}

 	back
 	{
 		type patch;
 		faces
 		(
 			(8 9 17 19)
			(9 10 14 17)
			(10 11 15 14)
 		);
 	}

 	front
 	{
 		type patch;
 		faces
 		(
 			(0 1 16 18)
			(1 2 6 16)
			(2 3 7 6)

 		);
 	}

);
























